evaluation/two-services/move-timer-read-microbenchmark/s1_no_rlock_d100-poker50000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=100
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_POKER_BATCH_THRESHOLD=50000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   202.77ms   67.03ms 681.76ms   81.78%
    Req/Sec   310.08    115.00   620.00     64.44%
  Latency Distribution
     50%  187.75ms
     75%  208.14ms
     90%  276.40ms
     99%  462.48ms
  7397 requests in 3.02s, 2.96MB read
Requests/sec:   2453.18
Transfer/sec:      0.98MB
[run.sh] Speed is 2453.18, duration is 24
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d24s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
Running 24s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   204.96ms   58.46ms 750.28ms   84.28%
    Req/Sec   311.66     98.76   616.00     57.21%
  Latency Distribution
     50%  189.90ms
     75%  209.18ms
     90%  266.01ms
     99%  442.05ms
  40000 requests in 24.00s, 15.98MB read
Requests/sec:   1666.66
Transfer/sec:    681.96KB
------------------------------
stop time: 15.973377
stop time: 15.948434
stop time: 16.147920
stop time: 16.106218
stop time: 16.158870
stop time: 16.266790
stop time: 16.225228
stop time: 16.122661
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-6f4d4455dd-wx4fs        719m         46Mi            
service1-84d4df999-fzhxt         930m         14Mi            
ubuntu-client-76886f6bbd-qbfdx   55m          11Mi            
[run.sh] Test finished with status 0