evaluation/two-services/move-timer-read-microbenchmark/s1_no_rlockd_200-poker10000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=200
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_POKER_BATCH_THRESHOLD=10000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   250.23ms   64.30ms 565.69ms   78.34%
    Req/Sec   244.95     57.36   370.00     72.08%
  Latency Distribution
     50%  232.28ms
     75%  283.58ms
     90%  341.80ms
     99%  431.14ms
  5857 requests in 3.03s, 2.34MB read
Requests/sec:   1931.86
Transfer/sec:    790.48KB
[run.sh] Speed is 1931.86, duration is 31
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d31s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
Running 31s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   252.10ms   64.40ms 704.98ms   81.10%
    Req/Sec   253.27     49.03   520.00     68.20%
  Latency Distribution
     50%  228.17ms
     75%  281.90ms
     90%  351.89ms
     99%  441.91ms
  40000 requests in 31.00s, 15.98MB read
Requests/sec:   1290.32
Transfer/sec:    527.97KB
------------------------------
stop time: 19.651415
stop time: 19.786229
stop time: 19.849701
stop time: 19.776759
stop time: 19.952768
stop time: 19.933766
stop time: 19.868069
stop time: 19.927538
[run.sh] Checking the resource usage
[run.sh] Test finished with status 0